IDENTIFICATION DIVISION.
PROGRAM-ID. HEALTH-ELIGIBILITY.
AUTHOR. ALINA Z.
DATE-WRITTEN. 19.04.2025


*> This COBOL program checkS if a client qualifies for health insurance based on age and employment status.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.

77 CLIENT-NAME      PIC A(30).
77 CLIENT-AGE       PIC 99.
77 EMPLOYED-STATUS  PIC X.  *> Y = Employed, N = Unemployed
77 QUALIFIED-FLAG   PIC X VALUE 'N'.
77 CONTINUE-FLAG    PIC X VALUE 'Y'.

PROCEDURE DIVISION.

MAIN-LOGIC.
  DISPLAY "HEALTH INSURANCE ELIGIBILITY CHECK".

  PERFORM UNTIL CONTINUE-FLAG NOT = 'Y'
   PERFORM GET-CLIENT-DATA
   PERFORM CHECK-ELIGIBILITY
   PERFORM DISPLAY-RESULT
   PERFORM ASK-CONTINUE
END-PERFORM.

DISPLAY "Session ended. Thank you!".
STOP RUN.

GET-CLIENT-DATA.
   DISPLAY "Enter client name:".
   ACCEPT CLIENT-NAME.
   DISPLAY "Enter client age:".
   ACCEPT CLIENT-AGE.
   DISPLAY "Is client employed? (Y/N):".
   ACCEPT EMPLOYED-STATUS.
   MOVE FUNCTION UPPER-CASE(EMPLOYED-STATUS) TO EMPLOYED-STATUS.

CHECK-ELIGIBILITY.
  MOVE 'N' TO QUALIFIED-FLAG.
  IF CLIENT-AGE >= 18 AND EMPLOYED-STATUS = 'Y'
  MOVE 'Y' TO QUALIFIED-FLAG
END-IF.

DISPLAY-RESULT.
 DISPLAY "Client" CLIENT-NAME.
 IF QUALIFIED-FLAG = 'Y'
   DISPLAY "Qualified for health insurance."
ELSE
   DISPLAY "Not qualified for health insurance."
END-IF.

ASK-CONTINUE.
  DISPLAY "Do you want to check another client? (Y/N):".
  ACCEPT CONTINUE-FLAG.
  MOVE FUNCTION UPPER-CASE(CONTINUE-FLAG) TO CONTINUE-FLAG.


