IDENTIFICATION DIVISION.
PROGRAM-ID. PAYROLL-CALCULATOR.
AUTHOR. ALINA Z.
DATE: 20.04.2025

* This COBOL program calculates employee payroll based on user input: number of hours worked and hourly pay rate.*
* It calculates gross pay, applies a fixed tax rate (20%), and outputs net pay.*

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
 77 EMP-NAME           PIC A(30).
 77 HOURS-WORKED       PIC 9(3)V99.
 77 HOURLY-RATE        PIC 9(3)V99.
 77 GROSS-PAY          PIC 9(5)V99.
 77 TAX-RATE           PIC 9(2)V99 VALUE 0.20.
 77 TAX-AMOUNT         PIC 9(5)V99.
 77 NET-PAY            PIC 9(5)V99.

 77 CONTINUE-FLAG      PIC X VALUE 'Y'.

PROCEDURE DIVISION.

BEGIN.
DISPLAY " EMPLOYEE PAYROLL SYSTEM".

PERFORM UNTIL CONTINUE-FLAG NOT= 'Y'
 PERFORM GET-EMPLOYEE-DATA
 PERFORM CALCULATE-PAY
 PERFORM DISPLAY-RESULTS
 PERFORM ASK-CONTINUE
END-PERFORM.

DISPLAY "Thank you for the Payroll Calculator!".
STOP RUN.

GET-EMPLOYEE-DATA.
 DISPLAY "Enter employee name: ".
 ACCEPT EMP-NAME.
 DISPLAY "Enter hours worked: ".
 ACCEPT HOURS-WORKED.
 DISPLAY "Enter hourly rate: ".
 ACCEPT HOURLY-RATE.

CALCULATE-PAY.
 COMPUTE GROSS-PAY = HOURS-WORKED * HOURLY-RATE.
 COMPUTE TAX-AMOUNT = GROSS-PAY * TAX-RATE.
 COMPUTE NET-PAY = GROSS-PAY - TAX-AMOUNT.

DISPLAY-RESULT.
 DISPLAY "Employee:" EMP-NAME.
 DISPLAY "Gross Pay: $" GROSS-PAY.
 DISPLAY "Tax Deducted (20%):" TAX-AMOUNT.
 DISPLAY "Net Pay: $" NET-PAY.

ASK-CONTINUE.
 DISPLAY "Do you want to enter another employee? (Y/N): ".
 ACCEPT CONTINUE-FLAG.
 MOVE FUNCTION UPPER-CASE (CONTINUE-FLAG) TO CONTINUE-FLAG.
