IDENTIFICATION DIVISION.
PROGRAM-ID. ODCZYTAJ-Z-PLIKU.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT PLIK-OSOB ASSIGN TO 'osoby.txt'
ORGANIZATION IS LINE SEQUENTIAL
FILE STATUS IS FS.

DATA DIVISION.
FILE SECTION.
FD PLIK-OSOB.
01 OSOBA-REKORD.
05 OSOBA-IMIE PIC A(20).
05 OSOBA-WIEK PIC 99.

    WORKING-STORAGE SECTION.
    01 FS   PIC XX.
    
PROCEDURE DIVISION.
   OPEN OUTPUT PLIK-OSOB.
   
   PERFORM UNTIL FS='10'
   READ PLIK-OSOB
   AT END
   MOVE '10' TO FS
   NOT AT END
   DISPLAY OSOBA-IMIE ' - ' OSOBA-WIEK 'lat'
   END-READ
   END-PERFORM.
   
   CLOSE PLIK-OSOB.
STOP RUN.
