IDENTIFICATION DIVISION.
PROGRAM-ID. ZAPIS-DO-PLIKU.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT PLIK-OSOB ASSIGN TO 'osoby.txt'
ORGANIZATION IS LINE SEQUENTIAL
FILE STATUS IS FS.

DATA DIVISION.
FILE SECTION.
FD PLIK-OSOB.
01 OSOBA-REKORD.
05 OSOBA-IMIE PIC A(20).
05 OSOBA-WIEK PIC 99.

    WORKING-STORAGE SECTION.
    01 FS   PIC XX.
    01 IMIE PIC A(20).
    01 WIEK PIC 99.
    01 I    PIC 9 VALUE 1.
    
PROCEDURE DIVISION.
   OPEN OUTPUT PLIK-OSOB.
   
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
   DISPLAY 'Podaj imie:'
   ACCEPT IMIE
   DISPLAY 'Podaj wiek:'
   ACCEPT WIEK
   MOVE IMIE TO OSOBA-IMIE
   MOVE WIEK TO OSOBA-WIEK
   WRITE OSOBA-REKORD
   END-PERFORM.
   
   CLOSE PLIK-OSOB.
STOP RUN.
