IDENTIFICATION DIVISION.
PROGRAM-ID. ZAPISZ-IMIONA.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 IMIONA.
   05 IMIE-TABLICA OCCURS 5 TIMES.
      10 IMIE-OSOBY PIC A(20).

01 I         PIC 9 VALUE 1.
01 SUMA      PIC 999 VALUE 0.
01 SREDNIA   PIC 99V9(2).
01 ILOSC     PIC 9 VALUE 5.

01 WIEK.
   05 WIEK-TABLICA OCCURS 5 TIMES.
      10 WIEK-WARTOSC PIC 99.

PROCEDURE DIVISION.


PERFORM VARYING I FROM 1 BY 1 UNTIL I > ILOSC
    DISPLAY "Podaj wiek osoby " I ":"
    ACCEPT WIEK-WARTOSC(I)
    ADD WIEK-WARTOSC(I) TO SUMA
END-PERFORM.


COMPUTE SREDNIA = SUMA / ILOSC
DISPLAY "Średni wiek to: " SREDNIA.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > ILOSC
    DISPLAY "Podaj imię nr " I ":"
    ACCEPT IMIE-TABLICA(I)
END-PERFORM.

DISPLAY "Wprowadzone imiona:".
PERFORM VARYING I FROM 1 BY 1 UNTIL I > ILOSC
    DISPLAY IMIE-TABLICA(I)
END-PERFORM.

STOP RUN.
